#include "main.h"

#define Battery_Ch 6

extern ADC_HandleTypeDef hadc1;
/**************************************************************************
函数功能：ACD初始化电池电压检测
入口参数：无
返回  值：无
作    者：平衡小车之家
**************************************************************************/
void  Adc_Init(void)
{    
    HAL_ADC_Start(&hadc1);
}		

/**************************************************************************
函数功能：AD采样
入口参数：ADC1 的通道
返回  值：AD转换结果
**************************************************************************/
uint32_t Get_Adc(uint8_t ch)   
{
	uint32_t value = 0;
	HAL_ADC_PollForConversion(&hadc1,10);
    value = HAL_ADC_GetValue(&hadc1);
	return value;
}

/**************************************************************************
函数功能：读取电池电压 
入口参数：无
返回  值：电池电压 单位MV
**************************************************************************/
int Get_battery_volt(void)   
{  
	int Volt;//电池电压
	Volt=Get_Adc(Battery_Ch)*3.3*11*1000/4096;	//电阻分压，具体根据原理图简单分析可以得到	
	return Volt;
}



